# У цьому файлі міститься сценарій гри.

# Визначення персонажів для гри.
# Аргумент color змінює колір ім’я персонажа.

define s = Character("Селена", color="#c8ffc8")
define h = Character("Шаол", color="#c8c8ff")
define d = Character("Дорін", color="#ffc8c8")
define p = Character("герцог Перантгон", color="#ffffc8")

# Гра починається тут.

label start:

    call splashscreen  # проигрываем интро
    return  # дальше Ren'Py покажет главное меню

    # Показ тла. Типово використовується заповнювач, але ви можете
    # додати файл (з назвою «bg room.png» або «bg room.jpg») до
    # теки images, щоб показати його.

    scene bg room

    # Наступний рядок показує спрайт персонажа. Тут використано заповнювач,
    # але ви можете замінити його, додавши файл з назвою «eileen happy.png»,
    # до теки images.

    show eileen happy

    # Ці рядки показують репліки діалогу.

    s "Ви створили нову гру Ren'Py."

    h "Додавши сюжет, зображення та музику, ви зможете оприлюднити її світові!"

    

    # На цьому гра закінчується.

    return
